export class Calendar {

    public static readonly y2019 = [
        {
            date: '2018-12-31', events: [
                {time: '18:00', text: 'Св. Літургія в подяку Господу Богу за прожитий 2018 рік.'},
            ]
        },
        {
            date: '2019-01-01', events: [
                {time: '18:00', text: 'Св. Літургія за Божі ласки в Новому, вже 2019-му, році.'},
            ]
        },
        {
            date: '2019-01-02', events: [
                {time: '18:00', text: 'Св. Літургія за упокій бл.п. о. Мечислава, Марії і Марійки Кордубів.'},
            ]
        },
        {
            date: '2019-01-03', events: [
                {time: '18:00', text: 'Св. Літургія за упокій бл.п. Marcel-Bernard Marceau.'},
            ]
        },
        {
            date: '2019-01-04', events: [
                {time: '18:00', text: 'Св. Літургія  за упокій бл.п. Anna Chromiak.'},
            ]
        },
        {
            date: '2019-01-05', events: [
                {time: '16:00', text: 'Св. Літургія.'},
                {time: '17:00', text: 'Вечірня.'},
            ]
        },
        {
            date: '2019-01-06', events: [
                {time: '10:00', text: 'Літургія св. Івана Золотоустого.'},
                {time: '21:00', text: 'Велике Повечір’я із Литією.'},
            ]
        },
        {
            date: '2019-01-07', events: [
                {time: '10:00', text: 'Урочиста Літургія св. Василія Великого. Мирування.'},
                {time: '18:00', text: 'Свята Літургія'},
            ]
        },
        {
            date: '2019-01-08', events: [
                {time: '10:00', text: 'Св. Літургія.'},
                {time: '18:00', text: 'Св. Літургія за упокій бл.п. Стефанії (Гарун) Король і бл.п. Івана Омеляна Король. Жертвує дочка.'},
            ]
        },
        {
            date: '2019-01-09', events: [
                {time: '10:00', text: 'Св. Літургія.'},
                {time: '18:00', text: 'Св. Літургія за упокій бл.п. Мирона Мончака.'},
            ]
        },
        {
            date: '2019-01-10', events: [
                {time: '10:00', text: 'Св. Літургія.'},
                {time: '18:00', text: 'Св. Літургія за упокій бл.п. Петра Зендрана – 1-ша річниця.'},
            ]
        },
        {
            date: '2019-01-11', events: [
                {time: '10:00', text: 'Св. Літургія.'},
                {time: '18:00', text: 'Св. Літургія в наміренні Анн-Марі та інших приятелів. Офірує п. Б. Мончак.'},
            ]
        },
        {
            date: '2019-01-12', events: [
                {time: '10:00', text: 'Св. Літургія за упокій бл.п. Тараса Кушнірика.'},
                {time: '16:00', text: 'Вечірня.'},
                {time: '17:00', text: 'Св. Літургія за упокій бл.п. о. Івана й Дарії Гаврилюків.'},
            ]
        },
        {
            date: '2019-01-13', events: [
                {time: '10:00', text: 'Св. Літургія за парохіян.'},
            ]
        },
        {
            date: '2019-01-14', events: [
                {time: '10:00', text: 'Св. Літургія Василія Великого.'},
            ]
        },
        {
            date: '2019-01-18', events: [
                {time: '10:00', text: 'Вечірня з Літургією cв. В. Великого. Освячення  води.'},
            ]
        },
        {
            date: '2019-01-19', events: [
                {time: '10:00', text: 'Літургія св. Івана Золотоустого. Освячення  води.'},
            ]
        },
        {
            date: '2019-01-20', events: [
                {time: '10:00', text: 'Літургія св. Івана Золотоустого.'},
                {time: '11:00', text: 'Після Літургії - Різдвяний концерт з участю о. Василя Брони.'}
            ]
        },
        {
            date: '2019-01-21', events: [
                {time: '7:45', text: 'Св. Літургія за Україну.'},
            ]
        },
        {
            date: '2019-01-22', events: [
                {time: '19:00', text: 'Св. Літургія за упокій бл. п. Марії Рихлінської – 1-ша річниця.'},
            ]
        },
        {
            date: '2019-01-23', events: [
                {time: '7:45', text: 'Св. Літургія  на всяке прошення.'},
            ]
        },
        {
            date: '2019-01-24', events: [
                {time: '16:00', text: 'Св. Літургія за упокій бл. п. Надії Теличин, 40-й день.'},
            ]
        },
        {
            date: '2019-01-25', events: [
                {time: '7:45', text: 'Свята Літургія в наміренні жертводавців.'},
            ]
        },
        {
            date: '2019-01-26', events: [
                {time: '16:00', text: 'Св. Літургія'},
                {time: '17:00', text: 'Вечірня'},
            ]
        },
        {
            date: '2019-01-27', events: [
                {time: '10:00', text: 'Свята Літургія за парохіян.'},
            ]
        },
        {
            date: '2019-01-28', events: [
                {time: '19:00', text: 'Св. Літургія за упокій бл. п. Андрія і Катерини Михалецьких. Офірує дочка Зоряна.'},
            ]
        },
        {
            date: '2019-01-29', events: [
                {time: '16:00', text: 'Св. Літургія за Україну.'},
            ]
        },
        {
            date: '2019-01-30', events: [
                {
                    time: '16:00',
                    text: 'Св. Літургія за упокій бл. п. о. Олега Корецького й всіх померших у родині. Жертвують дружина й діти.'
                },
            ]
        },
        {
            date: '2019-01-31', events: [
                {time: '19:00', text: 'Св. Літургія в наміренні жертводавців.'},
            ]
        },
        {
            date: '2019-02-01', events: [
                {time: '19:00', text: 'Св. Літургія в наміренні Шарлотти. Офірує Анн-Марі Наум’як.'},
            ]
        },
        {
            date: '2019-02-02', events: [
                {time: '16:00', text: 'Св. Літургія в наміренні Марселя. Офірує Анн-Марі Наум’як.'},
                {time: '17:00', text: 'Вечірня'},
            ]
        },
        {
            date: '2019-02-03', events: [
                {time: '10:00', text: 'Св. Літургія за парохіян.'}
            ]
        },
        {
            date: '2019-02-04', events: [
                {time: '16:00', text: 'Св. Літургія за Україну.'}
            ]
        },
        {
            date: '2019-02-05', events: [
                {time: '16:00', text: 'Св. Літургія в наміренні Матвія. Офірує Анн-Марі Наум’як.'},
                {time: '18:00', text: 'Засідання Церковного Комітету.'}
            ]
        },
        {
            date: '2019-02-06', events: [
                {time: '16:00', text: 'Св. Літургія  на всяке прошення.'}
            ]
        },
        {
            date: '2019-02-07', events: [
                {time: '16:00', text: 'Св. Літургія в наміренні жертводавців.'}
            ]
        },
        {
            date: '2019-02-08', events: [
                {time: '16:00', text: 'Свята Літургія в наміренні Кейсі. Жертвує Анн-Марі Наум’як.'}
            ]
        },
        {
            date: '2019-02-09', events: [
                {time: '16:00', text: 'Св. Літургія.'},
                {time: '17:00', text: 'Вечірня.'}
            ]
        },
        {
            date: '2019-02-10', events: [
                {time: '10:00', text: 'Свята Літургія за парохіян.'},
                {time: '11:30', text: 'п. Галина Кришталь проведе лекцію для молодих родин парохії.'},
                {
                    time: '13:00',
                    text: 'УНО та Організація Українок Канади ім. О. Басараб запрошують Вас на спільну кутю у домівці УНО (405 Fairmount, на розі з Hutchison).'
                }
            ]
        },
        {
            date: '2019-02-11', events: [
                {time: '18:00', text: 'Св. Літургія за Божу опіку для Надії та її синочка.'},
            ]
        },
        {
            date: '2019-02-12', events: [
                {time: '17:00', text: 'Св. Літургія. Трьох Святителів: свв. Василія Великого, Григорія Богослова та Йоана Золотоустого.'},
            ]
        },
        {
            date: '2019-02-13', events: [
                {time: '17:00', text: 'Св. Літургія  на всяке прошення.'},
            ]
        },
        {
            date: '2019-02-14', events: [
                {time: '17:00', text: 'Св. Літургія в наміренні жертводавців.'},
            ]
        },
        {
            date: '2019-02-15', events: [
                {time: '9:00', text: 'Свята Літургія за парохіян. Стрітення ГНІХ.'},
            ]
        },
        {
            date: '2019-02-16', events: [
                {time: '16:00', text: 'Свята Літургія.'},
                {time: '17:00', text: 'Вечірня.'},
            ]
        },
        {
            date: '2019-02-17', events: [
                {time: '10:00', text: 'Свята Літургія за парохіян.'},
            ]
        },
        {
            date: '2019-02-18', events: [
                {time: '17:00', text: 'Св. Літургія за упокій бл.п. Петра й Марти Михалецьких.'},
            ]
        },
        {
            date: '2019-02-19', events: [
                {time: '17:00', text: 'Св. Літургія в наміренні Анн-Марі Наум’як.'},
            ]
        },
        {
            date: '2019-02-20', events: [
                {time: '17:00', text: 'Св. Літургія  за Україну.'},
            ]
        },
        {
            date: '2019-02-21', events: [
                {time: '17:00', text: 'Св. Літургія в наміренні жертводавців.'},
            ]
        },
        {
            date: '2019-02-22', events: [
                {time: '17:00', text: 'Свята Літургія в наміренні Анн-Марі Наум’як.'},
            ]
        },
        {
            date: '2019-02-23', events: [
                {time: '16:00', text: 'Св. Літургія.'},
                {time: '17:00', text: 'Вечірня.'},
            ]
        },
        {
            date: '2019-02-24', events: [
                {time: '10:00', text: 'Свята Літургія за парохіян.'},
            ]
        },
        {
            date: '2019-02-25', events: [
                {time: '17:00', text: 'Св. Літургія за Україну.'},
            ]
        },
        {
            date: '2019-02-26', events: [
                {time: '17:00', text: 'Св. Літургія в наміренні Анн-Марі.'},
            ]
        },
        {
            date: '2019-02-27', events: [
                {time: '17:00', text: 'Св. Літургія за упокій бл.п. Володимира Кришталь 3-тя річниця. Офірує дочка.'},
            ]
        },
        {
            date: '2019-02-28', events: [
                {time: '17:00', text: 'Св. Літургія в наміренні жертводавців.'},
            ]
        },
        {
            date: '2019-03-01', events: [
                {time: '17:00', text: 'Свята Літургія в наміренні Анн-Марі.'},
            ]
        },
        {
            date: '2019-03-02', events: [
                {time: '16:00', text: 'Св. Літургія за покійних парохії.'},
                {time: '17:00', text: 'Вечірня.'},
            ]
        },
        {
            date: '2019-03-03', events: [
                {time: '10:00', text: 'Свята Літургія за парохіян.'},
            ]
        },
        {
            date: '2019-03-04', events: [
                {time: '17:00', text: 'Св. Літургія за Україну й добрі вибори президента.'},
            ]
        },
        {
            date: '2019-03-05', events: [
                {time: '17:00', text: 'Св. Літургія в наміренні Василя.'},
            ]
        },
        {
            date: '2019-03-06', events: [
                {time: '17:00', text: 'Св. Літургія на всяке прошення.'},
            ]
        },
        {
            date: '2019-03-07', events: [
                {time: '17:00', text: 'Св. Літургія в наміренні жертводавців.'},
            ]
        },
        {
            date: '2019-03-08', events: [
                {time: '17:00', text: 'Свята Літургія за одужання Бенджаміна.'},
            ]
        },
        {
            date: '2019-03-09', events: [
                {time: '16:00', text: 'Св. Літургія.'},
                {time: '17:00', text: 'Вечірня.'},
            ]
        },
        {
            date: '2019-03-10', events: [
                {time: '10:00', text: 'Свята Літургія за парохіян.'}
            ]
        },
        {
            date: '2019-03-11', events: [
                {time: '18:00', text: 'Вечірня.'}
            ]
        },
        {
            date: '2019-03-12', events: [
                {time: '18:00', text: 'Акафіст Христових Страстей.'}
            ]
        },
        {
            date: '2019-03-13', events: [
                {time: '18:00', text: 'Літургія Передосвячених Дарів.'}
            ]
        },
        {
            date: '2019-03-14', events: [
                {time: '18:00', text: 'Вечірня.'}
            ]
        },
        {
            date: '2019-03-15', events: [
                {time: '18:00', text: 'Сорокоусти.'},
                {time: '19:00', text: 'Хресна Дорога.'}
            ]
        },
        {
            date: '2019-03-16', events: [
                {time: '10:00', text: 'Св. Літургія за упокій бл.п. Володимира, Петра та Антона. Офірують Роман і Валентина Ґоляш.'},
                {time: '17:00', text: 'Вечірня.'}
            ]
        },
        {
            date: '2019-03-17', events: [
                {time: '10:00', text: 'Св. Літургія за парохіян.'}
            ]
        },
        {
            date: '2019-03-18', events: [
                {time: '18:00', text: ' Св. Літургія за упокій б.п. о. О. Корецького й всіх померших у його родині. Офірує дружина.'}
            ]
        },
        {
            date: '2019-03-19', events: [
                {time: '17:30', text: 'Св. Літургія за Україну й добрі вибори Президента.'},
                {time: '18:00', text: 'Акафіст Христових Страстей.'}
            ]
        },
        {
            date: '2019-03-20', events: [
                {time: '18:00', text: 'Літургія Передосвячених Дарів.'}
            ]
        },
        {
            date: '2019-03-21', events: [
                {time: '18:00', text: 'Св. Літургія в наміренні жертводавців.'}
            ]
        },
        {
            date: '2019-03-22', events: [
                {time: '18:00', tezxt: 'Сорокоусти.'},
                {time: '19:00', text: 'Хресна дорога.'}
            ]
        },
        {
            date: '2019-03-23', events: [
                {time: '16:00', text: 'Св. Літургія за упокій Магдалени, Павла й всіх спочилих нашої парохії.'},
                {time: '17:00', text: 'Вечірня.'}
            ]
        },
        {
            date: '2019-03-24', events: [
                {time: '10:00', text: 'Літургія св. Василія Великого.'}
            ]
        },
        {
            date: '2019-03-25', events: [
                {time: '18:00', text: 'Св. Літургія за Україну й добрі вибори Президента.'}
            ]
        },
        {
            date: '2019-03-26', events: [
                {time: '17:00', text: 'Св. Літургія за упокій бл.п. Катерини й Андрія Михалецьких. Офірує дочка Зоряна.'},
                {time: '18:00', text: 'Акафіст Христових Страстей.'}
            ]
        },
        {
            date: '2019-03-27', events: [
                {time: '18:00', text: 'Літургія Передосвячених Дарів.'}
            ]
        },
        {
            date: '2019-03-28', events: [
                {time: '18:00', text: 'Св. Літургія в наміренні Матвія.'}
            ]
        },
        {
            date: '2019-03-29', events: [
                {time: '18:00', text: 'Сорокоусти.'},
                {time: '19:00', text: 'Хресна Дорога.'}
            ]
        },
        {
            date: '2019-03-30', events: [
                {time: '16:00', text: 'Св. Літургія.'},
                {time: '17:00', text: 'Вечірня.'}
            ]
        },
        {
            date: '2019-03-31', events: [
                {time: '10:00', text: 'Свята Літургія за парохіян.'}
            ]
        },
        {
            date: '2019-04-01', events: [
                {time: '17:00', text: 'Св. Літургія за Україну.'}
            ]
        },
        {
            date: '2019-04-02', events: [
                {time: '17:00', text: 'Св. Літургія на всяке прошення.'}
            ]
        },
        {
            date: '2019-04-03', events: [
                {time: '18:00', text: 'Сорокоусти.'},
                {time: '19:00', text: 'Хресна дорога.'}
            ]
        },
        {
            date: '2019-04-04', events: [
                {time: '18:00', text: 'Св. Літургія в наміренні жертводавців.'}
            ]
        },
        {
            date: '2019-04-05', events: [
                {time: '18:00', text: 'Перший день Великопосних реколекцій. Літургія Передосвячених Дарів.'},
                {time: '19:00', text: 'Наука І.'}
            ]
        },
        {
            date: '2019-04-06', events: [
                {
                    time: '16:00',
                    text: 'Другий день Великопосних реколекцій. Св. Літургія за упокій бл.п. о. О. Корецького. Офірує дружина.'
                },
                {time: '17:00', text: 'Вечірня.  Наука ІІ'}
            ]
        },
        {
            date: '2019-04-07', events: [
                {time: '10:00', text: 'Закінчення Великопосних реколекцій. Літургія св. Василія Великого. Наука ІІІ.  Мирування.'}
            ]
        },
        {
            date: '2019-04-08', events: [
                {time: '10:00', text: 'Св. Літургія за упокій бл.п. Павла Гнатюка – 40-ий день.'}
            ]
        },
        {
            date: '2019-04-09', events: [
                {time: '18:00', text: 'Св. Літургія за упокій бл.п. Івана Ганича.'},
                {time: '19:00', text: 'Акафіст Христових Страстей.'}
            ]
        },
        {
            date: '2019-04-10', events: [
                {time: '18:00', text: 'Утреня з поклонами.'}
            ]
        },
        {
            date: '2019-04-11', events: [
                {time: '18:00', text: 'Св. Літургія в наміренні жертводавців.'}
            ]
        },
        {
            date: '2019-04-12', events: [
                {time: '18:00', text: 'Сорокоусти.'},
                {time: '19:00', text: 'Хресна дорога.'}
            ]
        },
        {
            date: '2019-04-13', events: [
                {time: '10:00', text: 'Св. Літургія.'},
                {time: '17:00', text: 'Вечірня.'}
            ]
        },
        {
            date: '2019-04-14', events: [
                {time: '10:00', text: 'Св. Літургія за парохіян.'}
            ]
        },
        {
            date: '2019-04-15', events: [
                {time: '18:00', text: 'Св. Літургія за Україну за упокій бл.п. Магдалени Ващук, 40-ий день. Жертвує родина.'}
            ]
        },
        {
            date: '2019-04-16', events: [
                {time: '17:00', text: 'Св. Літургія за Божу опіку для п. А. Ганич і її родини.'}
            ]
        },
        {
            date: '2019-04-17', events: [
                {time: '18:00', text: 'Служба Передосвячених Дарів.'}
            ]
        },
        {
            date: '2019-04-18', events: [
                {time: '18:00', text: 'Св. Літургія за Божу опіку для п. А. Ганич і її родини.'}
            ]
        },
        {
            date: '2019-04-19', events: [
                {time: '18:00', text: 'Сорокоусти.'},
                {time: '19:00', text: 'Хресна дорога.'}
            ]
        },
        {
            date: '2019-04-20', events: [
                {time: '16:00', text: 'Св. Літургія.'},
                {time: '17:00', text: 'Вечірня.'}
            ]
        },
        {
            date: '2019-04-21', events: [
                {time: '10:00', text: 'Вхід Господній у Єрусалим. Св. Літургія св. І. Золотоустого.  Благословення лози.'}
            ]
        },
        {
            date: '2019-04-22', events: [
                {time: '09:30', text: 'Св. Літургія за упокій бл.п. Марії Струмінської. 14-та річниця. Замовляє син Євген.'}
            ]
        },
        {
            date: '2019-04-23', events: [
                {time: '18:00', text: 'Вечірня.'}
            ]
        },
        {
            date: '2019-04-24', events: [
                {time: '18:00', text: 'Вечірня.'}
            ]
        },
        {
            date: '2019-04-25', events: [
                {time: '09:00', text: 'Св. Літургія за упокій бл.п. Лева й Христини Король (Хоцевич) Офірує д. Орися.'},
                {time: '18:00', text: 'Утреня Страстей. 12-ть Євангелій.'}
            ]
        },
        {
            date: '2019-04-26', events: [
                {time: '18:00', text: 'Вечірня з винесенням Плащаниці.'},
                {time: '19:00', text: 'Єрусалимська утреня. Молитва християнських родин.'}
            ]
        },
        {
            date: '2019-04-27', events: [
                {time: '16:30', text: 'Вечірня з Літургією св. В. Великого.'},
                {time: '18:00', text: 'Благословення пасок у парохіяльній залі.'}
            ]
        },
        {
            date: '2019-04-28', events: [
                {time: '08:30', text: 'Надгробне.'},
                {time: '09:00', text: 'Воскресна Утреня.'},
                {time: '10:00', text: 'Урочиста Літургія св. І. Золотоустого. Благословення артоса. Благословення пасок. Мирування.'}
            ]
        },
        {
            date: '2019-04-29', events: [
                {time: '10:00', text: 'Свята  Літургія.'},
                {time: '18:00', text: 'Свята  Літургія.'},
            ]
        },
        {
            date: '2019-04-30', events: [
                {time: '09:00', text: 'Свята  Літургія.'},
                {time: '18:00', text: 'Свята  Літургія.'},
            ]
        },
        {
            date: '2019-05-01', events: [
                {time: '18:00', text: 'Свята  Літургія.'},
                {time: '19:00', text: 'Молебень до Божої Матері.'},
            ]
        },
        {
            date: '2019-05-02', events: [
                {time: '18:00', text: 'Св. Літургія в наміренні жертводавців.'},
                {time: '19:00', text: 'Молебень до Божої Матері.'},
            ]
        },
        {
            date: '2019-05-03', events: [
                {time: '18:00', text: 'Літургія в наміренні давших.'}
            ]
        },
        {
            date: '2019-05-04', events: [
                {time: '16:00', text: 'Св. Літургія за упокій бл. п. о. Олега і Маркіяна Корецьких.'},
                {time: '17:00', text: 'Вечірня'}
            ]
        },
        {
            date: '2019-05-05', events: [
                {time: '10:00', text: 'Літургія за парохіян'}
            ]
        },
        {
            date: '2019-05-06', events: [
                {time: '10:00', text: 'Св. Літургія за упокій бл. п. Галини Ґоляш – 3-тя річниця. Офірують діти.'}
            ]
        },
        {
            date: '2019-05-07', events: [
                {time: '19:00', text: 'Молебень до Божої Матері.'}
            ]
        },
        {
            date: '2019-05-10', events: [
                {time: '19:00', text: 'Молебень до Божої Матері.'}
            ]
        },
        {
            date: '2019-05-12', events: [
                {time: '11:00', text: 'Свята Літургія за парохіян.'}
            ]
        },
        {
            date: '2019-05-15', events: [
                {time: '19:00', text: 'Молебень до Божої Матері.'}
            ]
        },
        {
            date: '2019-05-17', events: [
                {time: '19:00', text: 'Молебень до Божої Матері.'}
            ]
        },
        {
            date: '2019-05-18', events: [
                {time: '16:00', text: 'Св. Літургія за упокій бл. п. Федора Безпальок, 40-ий день.'}
            ]
        },
        {
            date: '2019-05-19', events: [
                {time: '11:00', text: 'Свята Літургія за парохіян.'}
            ]
        },
        {
            date: '2019-05-22', events: [
                {time: '19:00', text: 'Молебень до Божої Матері.'}
            ]
        },
        {
            date: '2019-05-24', events: [
                {time: '19:00', text: 'Молебень до Божої Матері.'}
            ]
        },
        {
            date: '2019-05-26', events: [
                {time: '11:00', text: 'Свята Літургія за парохіян.'}
            ]
        },
        {
            date: '2019-05-29', events: [
                {time: '19:00', text: 'Молебень до Божої Матері.'}
            ]
        },
        {
            date: '2019-05-31', events: [
                {time: '19:00', text: 'Молебень до Божої Матері.'}
            ]
        },
        {
            date: '2019-06-02', events: [
                {time: '10:00', text: 'Свята Літургія за парохіян.'}
            ]
        }
    ];

    public static getDayOfWeek(date: string) {
        switch (new Date(Date.parse(date)).getDay()) {
            case 0:
                return 'Понеділок';
            case 1:
                return 'Вівторок';
            case 2:
                return 'Середа';
            case 3:
                return 'Четверг';
            case 4:
                return 'Пятниця';
            case 5:
                return 'Субота';
            case 6:
                return 'Неделя';
        }
    }

}
